Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
aws_iam_role_policy_attachment.eks_cluster_AmazonEKSNetworkingPolicy will be created
+ resource "aws_iam_role_policy_attachment" "eks_cluster_AmazonEKSNetworkingPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSNetworkingPolicy"
      + role       = "devopslite_dev_eks_cluster_role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_cluster_serviceaccount_vpc_cni_policy_attachment will be created
+ resource "aws_iam_role_policy_attachment" "eks_cluster_serviceaccount_vpc_cni_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "devopslite_dev_eks_serviceaccount_role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_group_AmazonEC2ContainerRegistryPullOnly will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_group_AmazonEC2ContainerRegistryPullOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPullOnly"
      + role       = "devopslite_dev_eks_node_group_role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_group_AmazonEKSWorkerNodePolicy will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_group_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "devopslite_dev_eks_node_group_role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_group_AmazonEKS_CNI_Policy will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_group_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "devopslite_dev_eks_node_group_role"
    }

  # module.eks.aws_iam_role_policy_attachment.eks_node_group_AmazonSSMManagedInstanceCore will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_group_AmazonSSMManagedInstanceCore" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "devopslite_dev_eks_node_group_role"
    }

  # module.eks.aws_launch_template.eks_node_group_launch_template will be created
+ resource "aws_launch_template" "eks_node_group_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + ebs_optimized          = "true"
      + id                     = (known after apply)
      + image_id               = "ami-0fc0fcfedc3b329b5"
      + instance_type          = "t3.medium"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "devopslite-dev-eks-ng-"
      + tags_all               = (known after apply)
      + update_default_version = true
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + iops        = (known after apply)
              + throughput  = (known after apply)
              + volume_size = 20
              + volume_type = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "dev"
              + "Name"        = "devopslite-dev-eks-ng-node"
              + "Project"     = "devopslite"
              + "Provisioner" = "terraform"
            }
        }
    }

  # module.eks.aws_security_group.eks_node_sg will be created
+ resource "aws_security_group" "eks_node_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all traffic to all destinations"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = "Allow all traffic from VPC CIDR"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic from EKS Control Plane SG"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 65535
            },
        ]
      + name                   = "devopslite-dev-eks-node-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-eks-node-sg"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-eks-node-sg"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.eks_control_plane_bastion_ingress_rule will be created
+ resource "aws_security_group_rule" "eks_control_plane_bastion_ingress_rule" {
      + description              = "Allow traffic from EKS node group to control plane"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.eks_control_plane_ingress_rule will be created
+ resource "aws_security_group_rule" "eks_control_plane_ingress_rule" {
      + description              = "Allow traffic from EKS node group to control plane"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks_access.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.eks_access.aws_eks_access_entry.eks_access_entry will be created
+ resource "aws_eks_access_entry" "eks_access_entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "devopslite-dev-eks-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "admin",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = (known after apply)
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks_access.aws_eks_access_policy_association.eks_access_policy will be created
+ resource "aws_eks_access_policy_association" "eks_access_policy" {
      + associated_at = (known after apply)
      + cluster_name  = "devopslite-dev-eks-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = (known after apply)

      + access_scope {
          + type = "cluster"
        }
    }

  # module.kms.aws_kms_alias.kms_alias will be created
+ resource "aws_kms_alias" "kms_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/devopslite-dev-kms-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.kms.aws_kms_key.kms_key will be created
+ resource "aws_kms_key" "kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key used to encrypt data for all services in this demo"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-kms-key"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-kms-key"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
    }

  # module.kms.aws_kms_key_policy.kms_key_policy will be created
+ resource "aws_kms_key_policy" "kms_key_policy" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "key-default-1"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::381492199798:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReplicateKey",
                          + "kms:Create*",
                          + "kms:Describe*",
                          + "kms:Enable*",
                          + "kms:List*",
                          + "kms:Put*",
                          + "kms:Update*",
                          + "kms:Revoke*",
                          + "kms:Disable*",
                          + "kms:Get*",
                          + "kms:Delete*",
                          + "kms:ScheduleKeyDeletion",
                          + "kms:CancelKeyDeletion",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::381492199798:user/cloud_user"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow administration of the key"
                    },
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey",
                          + "kms:GenerateDataKeyWithoutPlaintext",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::381492199798:user/cloud_user"
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "ecr.amazonaws.com",
                              + "eks.amazonaws.com",
                              + "logs.amazonaws.com",
                              + "vpc-flow-logs.amazonaws.com",
                              + "waf.amazonaws.com",
                              + "waf-regional.amazonaws.com",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Allow use of the key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.ssm.aws_iam_instance_profile.ssm_instance_profile will be created
+ resource "aws_iam_instance_profile" "ssm_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "devopslite_dev_ssm_instance_profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "devopslite_dev_ssm_role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.ssm.aws_iam_role.ssm_role will be created
+ resource "aws_iam_role" "ssm_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for SSM"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "devopslite_dev_ssm_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ssm.aws_iam_role_policy_attachment.ssm_policy_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ssm_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "devopslite_dev_ssm_role"
    }

  # module.vpc.aws_default_security_group.default_sg will be created
+ resource "aws_default_security_group" "default_sg" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.eip_nat_gw will be created
+ resource "aws_eip" "eip_nat_gw" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = "amazon"
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-eip-nat-gw"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-eip-nat-gw"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.internet_gw will be created
+ resource "aws_internet_gateway" "internet_gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-gw"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
          + "VPC"         = "devopslite-dev"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-gw"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
          + "VPC"         = "devopslite-dev"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.nat_gw will be created
+ resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-nat-gw"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-nat-gw"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
    }

  # module.vpc.aws_route_table.private_route_table will be created
+ resource "aws_route_table" "private_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-private-rtb"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
          + "State"       = "private"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-private-rtb"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
          + "State"       = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public_route_table will be created
+ resource "aws_route_table" "public_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-public-rtb"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
          + "State"       = "public"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-public-rtb"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
          + "State"       = "public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.route_association_private[0] will be created
+ resource "aws_route_table_association" "route_association_private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.route_association_private[1] will be created
+ resource "aws_route_table_association" "route_association_private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.route_association_private[2] will be created
+ resource "aws_route_table_association" "route_association_private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.route_association_public[0] will be created
+ resource "aws_route_table_association" "route_association_public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.route_association_public[1] will be created
+ resource "aws_route_table_association" "route_association_public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.route_association_public[2] will be created
+ resource "aws_route_table_association" "route_association_public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet[0] will be created
+ resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                                      = "dev"
          + "Name"                                             = "devopslite-dev-private-0"
          + "Project"                                          = "devopslite"
          + "Provisioner"                                      = "terraform"
          + "State"                                            = "private"
          + "VPC"                                              = "devopslite-dev"
          + "kubernetes.io/cluster/devopslite-dev-eks-cluster" = "owned"
          + "kubernetes.io/role/internal-elb"                  = "1"
        }
      + tags_all                                       = {
          + "Environment"                                      = "dev"
          + "Name"                                             = "devopslite-dev-private-0"
          + "Project"                                          = "devopslite"
          + "Provisioner"                                      = "terraform"
          + "State"                                            = "private"
          + "VPC"                                              = "devopslite-dev"
          + "kubernetes.io/cluster/devopslite-dev-eks-cluster" = "owned"
          + "kubernetes.io/role/internal-elb"                  = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet[1] will be created
+ resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                                      = "dev"
          + "Name"                                             = "devopslite-dev-private-1"
          + "Project"                                          = "devopslite"
          + "Provisioner"                                      = "terraform"
          + "State"                                            = "private"
          + "VPC"                                              = "devopslite-dev"
          + "kubernetes.io/cluster/devopslite-dev-eks-cluster" = "owned"
          + "kubernetes.io/role/internal-elb"                  = "1"
        }
      + tags_all                                       = {
          + "Environment"                                      = "dev"
          + "Name"                                             = "devopslite-dev-private-1"
          + "Project"                                          = "devopslite"
          + "Provisioner"                                      = "terraform"
          + "State"                                            = "private"
          + "VPC"                                              = "devopslite-dev"
          + "kubernetes.io/cluster/devopslite-dev-eks-cluster" = "owned"
          + "kubernetes.io/role/internal-elb"                  = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnet[2] will be created
+ resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.30.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                                      = "dev"
          + "Name"                                             = "devopslite-dev-private-2"
          + "Project"                                          = "devopslite"
          + "Provisioner"                                      = "terraform"
          + "State"                                            = "private"
          + "VPC"                                              = "devopslite-dev"
          + "kubernetes.io/cluster/devopslite-dev-eks-cluster" = "owned"
          + "kubernetes.io/role/internal-elb"                  = "1"
        }
      + tags_all                                       = {
          + "Environment"                                      = "dev"
          + "Name"                                             = "devopslite-dev-private-2"
          + "Project"                                          = "devopslite"
          + "Provisioner"                                      = "terraform"
          + "State"                                            = "private"
          + "VPC"                                              = "devopslite-dev"
          + "kubernetes.io/cluster/devopslite-dev-eks-cluster" = "owned"
          + "kubernetes.io/role/internal-elb"                  = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet[0] will be created
+ resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                                      = "dev"
          + "Name"                                             = "devopslite-dev-public-0"
          + "Project"                                          = "devopslite"
          + "Provisioner"                                      = "terraform"
          + "State"                                            = "public"
          + "VPC"                                              = "devopslite-dev"
          + "kubernetes.io/cluster/devopslite-dev-eks-cluster" = "owned"
          + "kubernetes.io/role/elb"                           = "1"
        }
      + tags_all                                       = {
          + "Environment"                                      = "dev"
          + "Name"                                             = "devopslite-dev-public-0"
          + "Project"                                          = "devopslite"
          + "Provisioner"                                      = "terraform"
          + "State"                                            = "public"
          + "VPC"                                              = "devopslite-dev"
          + "kubernetes.io/cluster/devopslite-dev-eks-cluster" = "owned"
          + "kubernetes.io/role/elb"                           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet[1] will be created
+ resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                                      = "dev"
          + "Name"                                             = "devopslite-dev-public-1"
          + "Project"                                          = "devopslite"
          + "Provisioner"                                      = "terraform"
          + "State"                                            = "public"
          + "VPC"                                              = "devopslite-dev"
          + "kubernetes.io/cluster/devopslite-dev-eks-cluster" = "owned"
          + "kubernetes.io/role/elb"                           = "1"
        }
      + tags_all                                       = {
          + "Environment"                                      = "dev"
          + "Name"                                             = "devopslite-dev-public-1"
          + "Project"                                          = "devopslite"
          + "Provisioner"                                      = "terraform"
          + "State"                                            = "public"
          + "VPC"                                              = "devopslite-dev"
          + "kubernetes.io/cluster/devopslite-dev-eks-cluster" = "owned"
          + "kubernetes.io/role/elb"                           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet[2] will be created
+ resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                                      = "dev"
          + "Name"                                             = "devopslite-dev-public-2"
          + "Project"                                          = "devopslite"
          + "Provisioner"                                      = "terraform"
          + "State"                                            = "public"
          + "VPC"                                              = "devopslite-dev"
          + "kubernetes.io/cluster/devopslite-dev-eks-cluster" = "owned"
          + "kubernetes.io/role/elb"                           = "1"
        }
      + tags_all                                       = {
          + "Environment"                                      = "dev"
          + "Name"                                             = "devopslite-dev-public-2"
          + "Project"                                          = "devopslite"
          + "Provisioner"                                      = "terraform"
          + "State"                                            = "public"
          + "VPC"                                              = "devopslite-dev"
          + "kubernetes.io/cluster/devopslite-dev-eks-cluster" = "owned"
          + "kubernetes.io/role/elb"                           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.vpc will be created
+ resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-vpc"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-vpc"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
    }

  # module.vpc_endpoint.aws_security_group.vpc_endpoint_sg will be created
+ resource "aws_security_group" "vpc_endpoint_sg" {
      + arn                    = (known after apply)
      + description            = "Security Group for VPC Endpoints"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all traffic to all destinations"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = "Allow all traffic to VPC Endpoint"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "devopslite-dev-vpc-endpoint-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-vpc-endpoint-sg"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-vpc-endpoint-sg"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ec2 will be created
+ resource "aws_vpc_endpoint" "ec2" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ec2"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-ec2-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-ec2-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ec2messages will be created
+ resource "aws_vpc_endpoint" "ec2messages" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ec2messages"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-ec2messages-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-ec2messages-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ecr_api will be created
+ resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ecr.api"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-ecr-api-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-ecr-api-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ecr_dkr will be created
+ resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ecr.dkr"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-ecr-dkr-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-ecr-dkr-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.eks will be created
+ resource "aws_vpc_endpoint" "eks" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.eks"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-eks-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-eks-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.eks_auth will be created
+ resource "aws_vpc_endpoint" "eks_auth" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.eks-auth"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-eks-auth-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-eks-auth-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.elb will be created
+ resource "aws_vpc_endpoint" "elb" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.elasticloadbalancing"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-elb-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-elb-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.kms will be created
+ resource "aws_vpc_endpoint" "kms" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.kms"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-kms-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-kms-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.logs will be created
+ resource "aws_vpc_endpoint" "logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.logs"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-logs-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-logs-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.s3 will be created
+ resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.s3"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-s3-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-s3-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ssm will be created
+ resource "aws_vpc_endpoint" "ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ssm"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-ssm-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-ssm-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ssmmessages will be created
+ resource "aws_vpc_endpoint" "ssmmessages" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ssmmessages"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-ssmmessages-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-ssmmessages-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.sts will be created
+ resource "aws_vpc_endpoint" "sts" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.sts"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-sts-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-sts-vpc-endpoint"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

Plan: 77 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ eks_cluster_endpoint                = (known after apply)
+ eks_cluster_id                      = (known after apply)
+ eks_cluster_oidc_issuer_url         = (known after apply)
+ eks_cluster_security_group_id       = (known after apply)
+ eks_cluster_serviceaccount_role_arn = (known after apply)
+ eks_node_group_arn                  = (known after apply)
+ eks_node_group_role_arn             = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://07fd211fa485:4141/lock?id=dungpham91%252Fdevops.demo.terraform%252Fenv%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p dev
  ```
Plan: 77 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```